fonecmid-diplom/src/Documents/ВКМ_НачислениеЗаработнойПлаты/ВКМ_НачислениеЗаработнойПлаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗаработнойПлаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_УчетОтпусков</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НачисленияЗП</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.BKM_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
        <types>ChartOfCalculationTypesRef.ВКМ_ДополнительныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРабот</name>
      <type>
        <types>CatalogRef.ВКМ_ГрафикиРабот</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.BKM_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Отпуск</name>
      <description>Отпуск</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

fonecmid-diplom/src/Documents/ВКМ_НачислениеЗаработнойПлаты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяКоманды = "Заполнить";
	КомандаЗаполнения = Команды.Добавить(ИмяКоманды);
	КомандаЗаполнения.Действие  = "ЗаполнитьНаКлиенте";
	КомандаЗаполнения.Заголовок = "Заполнить";
	
	ЭлементПанель = Элементы.НачисленияЗПКоманднаяПанель; 
	НоваяКнопка = Элементы.Добавить("КнопкаЗаполнить", Тип("КнопкаФормы"), ЭлементПанель);
	НоваяКнопка.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНачисленияЗП
&НаКлиенте
Процедура НачисленияЗПВидРасчетаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	МассивРазрешенных = Новый Массив;
	МассивРазрешенных.Добавить(ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад"));
	МассивРазрешенных.Добавить(ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск"));
	МассивРазрешенных.Добавить(ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияПроцентом"));
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", МассивРазрешенных);
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(НовыйПараметр);
	
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьНаКлиенте(Команда) Экспорт
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.НачисленияЗП.Очистить();
	
	НачалоПериода = НачалоМесяца(Объект.ПериодРегистрации);
	КонецПериода = КонецМесяца(Объект.ПериодРегистрации);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	BKM_Сотрудники.Ссылка КАК Сотрудник,
		|	ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад) КАК ВидРасчета
		|ИЗ
		|	Справочник.BKM_Сотрудники КАК BKM_Сотрудники
		|ГДЕ
		|	НЕ BKM_Сотрудники.ПометкаУдаления
		|	И НЕ BKM_Сотрудники.Наименование ПОДОБНО ""%Не указан%""
		|	И НЕ BKM_Сотрудники.Наименование ПОДОБНО ""%Сервер%""
		|	И НЕ BKM_Сотрудники.Наименование = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник,
		|	ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияПроцентом)
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты";

	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОсновнойГрафик = Справочники.ВКМ_ГрафикиРабот.НайтиПоНаименованию("5-2");
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.НачисленияЗП.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		НоваяСтрока.ВидРасчета = Выборка.ВидРасчета;
		
		Если Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад 
			ИЛИ Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияПроцентом Тогда
			НоваяСтрока.ГрафикРабот = ОсновнойГрафик;
		КонецЕсли;

		НоваяСтрока.ДатаНачала = НачалоПериода;
		НоваяСтрока.ДатаОкончания = КонецПериода;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
